[
    {
     "id": 1,
     "image": "",
     "name" : "One-pan pasta",
     "ingredients": ["1 tbsp rapeseed oil",
                    "12 meatballs (300g)",
                    "1 onion, finely chopped",
                    "3 garlic cloves, finely chopped",
                    "2 tbsp ketchup",
                    "2 x 400g cans chopped tomatoes",
                    "1 large bunch of basil, finely chopped, plus a few whole leaves",
                    "225g dried spaghetti" ],
    "method": [
        "Step1: Heat the oil in a deep, wide frying pan or casserole dish over a medium-high heat. Tip in the meatballs and cook for 5 mins, turning until browned all over. Add the onion and garlic, and fry for 8 more mins until softened.",
        "Step2: Add the ketchup, chopped tomatoes, chopped basil and 400ml water to the pan and bring to the boil. Add the spaghetti and cook for 10-12 mins, stirring occasionally. When the pasta is cooked and the sauce has reduced, season and sprinkle with the basil leaves to serve."
    ],
    "preptime":[
        0,0,0,0,0,0,5,0,0,0
    ],
    "cooktime": [
        0,0,0,0,0,0,30,0,0,0
    ],
    "nutrition": [
        "kcal:477",
        "fat:13g",
        "saturates:4g",
        "carbs:58g",
        "sugars:14g",
        "fibre:5g",
        "protein:30g",
        "salt:0.7g"
    ]
        },
        
        {
             "id": 2,
             "image": "",
             "name" : "Sausage ragu",
             "ingredients": ["3 tbsp olive oil",
                "1 onion, finely chopped",
                "2 large garlic cloves, crushed",
                "¼ tsp chilli flakes",
                "2 rosemary sprigs, leaves finely chopped",
                "2 x 400g cans chopped tomatoes",
                "1 tbsp brown sugar",
                "6 pork sausages",
                "150ml whole milk",
                "1 lemon, zested",
                "350g rigatoni pasta",
                "grated parmesan and ½ small bunch parsley, leaves roughly chopped, to serve"
            ],
            "method": [
                "Step1: Heat 2 tbsp of the oil in a saucepan over a medium heat. Fry the onion with a pinch of salt for 7 mins. Add the garlic, chilli and rosemary, and cook for 1 min more. Tip in the tomatoes and sugar, and simmer for 20 mins.",
                "Step2: Heat the remaining oil in a medium frying pan over a medium heat. Squeeze the sausagemeat from the skins and fry, breaking it up with a wooden spoon, for 5-7 mins until golden. Add to the sauce with the milk and lemon zest, then simmer for a further 5 mins. To freeze, leave to cool completely and transfer to large freezerproof bags.",
                "Step3: Cook the pasta following pack instructions. Drain and toss with the sauce. Scatter over the parmesan and parsley leaves to serve."
            ],
            "preptime":[
                0,0,0,0,0,0,5,0,0,0
            ],
            "cooktime": [
                0,0,0,0,0,0,45,0,0,0
            ],
            "nutrition": [
                "kcal:589",
                "fat:18g",
                "saturates:5g",
                "carbs:83g",
                "sugars:18g",
                "fibre:8g",
                "protein:19g",
                "salt:0.5g"
            ]
        }

]
